[
  {
    "_id": "0282e0e58a5c404fbd15261f11c2ab6a",
    "others_info": {
      "is_todays_pick": false,
      "is_trending": true
    },
    "category_id": "01",
    "title": "Introduction",
    "image_url": "https://media.geeksforgeeks.org/wp-content/cdn-uploads/20220714150931/JavaScript-Introduction.jpg",
    "details": "JavaScript is a cross-platform, object-oriented scripting language used to make webpages interactive (e.g., having complex animations, clickable buttons, popup menus, etc.). There are also more advanced server side versions of JavaScript such as Node.js, which allow you to add more functionality to a website than downloading files (such as realtime collaboration between multiple computers). Inside a host environment (for example, a web browser), JavaScript can be connected to the objects of its environment to provide programmatic control over them.JavaScript contains a standard library of objects, such as Array, Date, and Math, and a core set of language elements such as operators, control structures, and statements."
  },
  {
    "_id": "0282e0e58a5c404fbd15261f11c2ab6b",
    "others_info": {
      "is_todays_pick": false,
      "is_trending": true
    },
    "category_id": "02",
    "title": "Variables",
    "image_url": "https://blog.alexdevero.com/wp-content/uploads/2020/02/24-02-20-javascript-variables-pt1-blog.jpg",
    "details": "A JavaScript variable is simply a name of storage location.There are two types of variables in JavaScript : local variable and global variable.There are some rules while declaring a JavaScript variable (also known as identifiers).1:Name must start with a letter (a to z or A to Z), underscore( _ ), or dollar( $ ) sign. 2:After first letter we can use digits (0 to 9),for example value1.3:JavaScript variables are case sensitive, for example x and X are different variables."
  },
  {
    "_id": "0282e0e58a5c404fbd15261f11c2ab6c",
    "others_info": {
      "is_todays_pick": false,
      "is_trending": true
    },
    "category_id": "03",
    "title": "Async & Await",
    "image_url": "https://miro.medium.com/max/1200/1*KeSreLBdn5kB1rQtLnV6tg.jpeg",
    "details": "There’s a special syntax to work with promises in a more comfortable fashion, called “async/await”. It’s surprisingly easy to understand and use.The word “async” before a function means one simple thing: a function always returns a promise. Other values are wrapped in a resolved promise automatically.So, async ensures that the function returns a promise, and wraps non-promises in it. Simple enough, right? But not only that. There’s another keyword, await, that works only inside async functions, and it’s pretty cool.The keyword await makes JavaScript wait until that promise settles and returns its result.The function execution “pauses” at the line (*) and resumes when the promise settles, with result becoming its result. So the code above shows “done!” in one second.Let’s emphasize: await literally suspends the function execution until the promise settles, and then resumes it with the promise result. That doesn’t cost any CPU resources, because the JavaScript engine can do other jobs in the meantime: execute other scripts, handle events, etc.It’s just a more elegant syntax of getting the promise result than promise.then. And, it’s easier to read and write."
  },
  {
    "_id": "0282e0e58a5c404fbd15261f11c2ab6d",
    "others_info": {
      "is_todays_pick": false,
      "is_trending": true
    },
    "category_id": "04",
    "title": "Objects",
    "image_url": "https://blog.alexdevero.com/wp-content/uploads/2021/01/25-01-21-how-to-access-object-properties-in-javascript-in-three-ways-blog.jpg",
    "details": "The Object type represents one of JavaScript's data types. It is used to store various keyed collections and more complex entities. Objects can be created using the Object() constructor or the object initializer / literal syntax.Nearly all objects in JavaScript are instances of Object; a typical object inherits properties (including methods) from Object.prototype, although these properties may be shadowed (a.k.a. overridden). However, an Object may be deliberately created for which this is not true (e.g. by Object.create(null)), or it may be altered so that this is no longer true (e.g. with Object.setPrototypeOf).Changes to the Object prototype object are seen by all objects through prototype chaining, unless the properties and methods subject to those changes are overridden further along the prototype chain. This provides a very powerful although potentially dangerous mechanism to override or extend object behavior."
  },
  {
    "_id": "0282e0e58a5c404fbd15261f11c2ab6e",
    "others_info": {
      "is_todays_pick": false,
      "is_trending": true
    },
    "category_id": "05",
    "title": "Condition",
    "image_url": "https://s3-us-west-2.amazonaws.com/cleverbeagle-uploads/What-is-Conditional-Logic-in-JavaScript.png",
    "details": "The if statement executes a statement if a specified condition is truthy. If the condition is falsy, another statement in the optional else clause will be executed.There are times in JavaScript where you might consider using a switch statement instead of an if else statement.switch statements can have a cleaner syntax over complicated if else statements.Take a look at the example below – instead of using this long if else statement, you might choose to go with an easier to read switch statement."
  },
  {
    "_id": "0282e0e58a5c404fbd15261f11c2ab6f",
    "others_info": {
      "is_todays_pick": false,
      "is_trending": true
    },
    "category_id": "06",
    "title": "Array",
    "image_url": "https://cdn.educba.com/academy/wp-content/uploads/2019/09/Arrays-in-JavaScript.png",
    "details": "The Array object, as with arrays in other programming languages, enables storing a collection of multiple items under a single variable name, and has members for performing common array operations.In JavaScript, arrays aren't primitives but are instead Array objects with the following core characteristics:1-JavaScript arrays are resizable and can contain a mix of different data types. (When those characteristics are undesirable, use typed arrays instead.).2-JavaScript arrays are not associative arrays and so, array elements cannot be accessed using arbitrary strings as indexes, but must be accessed using nonnegative integers (or their respective string form) as indexes.3-JavaScript arrays are zero-indexed: the first element of an array is at index 0, the second is at index 1, and so on — and the last element is at the value of the array's length property minus 1. 4-JavaScript array-copy operations create shallow copies. (All standard built-in copy operations with any JavaScript objects create shallow copies, rather than deep copies)."
  }
]